{
    "1_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "2_January": [
        "Conclusion of the six-day Yuletide festival in the Shire Calendar.",
        "T.A. 3019:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "3_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "4_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "5_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "6_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "7_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "8_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring reach Hollin. Crebain appear.",
        "Full moon[1]"
    ],
    "9_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels towards Caradhras.",
        "A shadow passes above the Fellowship of the Ring before dawn."
    ],
    "10_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels towards Caradhras."
    ],
    "11_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring camps at the foot of the Redhorn Pass, and that night unsuccessfully tries to cross."
    ],
    "12_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring defeated by Caradhras return to Hollin. They camp on a small hill and in the night are attacked by a pack of Wargs."
    ],
    "13_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring is attacked a second time by a pack of Wargs in the early hours.",
        "They reach the West-gate of Moria at nightfall. The Watcher attacks and jams the West-gate.",
        "Bill the Pony leaves.",
        "Gollum begins to trail the Ring-bearer."
    ],
    "14_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring travel through Moria from mid-morning to evening. They spend the night in Hall Twenty-one."
    ],
    "15_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring find the Chamber of Mazarbul and Balin's Tomb. Gimli takes the Book of Mazarbul.",
        "Attack of the Orcs and the Balrog. Gandalf destroys the Bridge of Khazad-dûm and falls with Durin's Bane.",
        "The rest of the Fellowship exits Moria and enters Dimrill Dale.",
        "Gimli, Frodo and Sam gaze in Mirrormere.",
        "Haldir, Rúmil and Orophin meet the Fellowship. They sleep on flets.",
        "Orcs pass through Lothlórien."
    ],
    "16_January": [
        "T.A. 3019:",
        "Frodo wakes and hears Orcs moving past the flet on which he is sleeping, along with Gollum climbing the trunk of the tree.",
        "The Fellowship of the Ring is led through Lórien.",
        "Last quarter of the Moon.[1]"
    ],
    "17_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring pass the Silverlode and reach the Naith and Cerin Amroth.",
        "The Orcs following them are killed or flee to the Misty Mountains.",
        "The Fellowship comes to Caras Galadhon in the evening."
    ],
    "18_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "Saruman hears of the Fellowship of the Ring and sends a company led by Uglúk to intercept them."
    ],
    "19_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "20_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "21_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "22_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "Uglúk's troop reach Moria, and gather a group of Orcs there.",
        "New moon[1]"
    ],
    "23_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "Gandalf pursues the Balrog to the peak of Celebdil."
    ],
    "24_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "Gollum is captured by Uglúk. He later escapes. Saruman sends reinforcements to Uglúk; his troop is now about 180 strong."
    ],
    "25_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "Gandalf casts down the Balrog, and passes away. His body lies on the peak. The Endless Stair is destroyed."
    ],
    "26_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "27_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "28_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "29_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "30_January": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "First quarter[1]"
    ],
    "31_January": [
        "Note: Months of the Shire Calendar only have 30 days, so no events have nor will happen on the 31st."
    ],
    "1_February": [
        "T.A. 3017:",
        "Aragorn captures Gollum in the Dead Marshes.",
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "2_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "3_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "4_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "5_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "6_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "Uglúk and his troop search northern Rohan for the Fellowship."
    ],
    "7_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "8_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "Full moon [1]"
    ],
    "9_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "10_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "North of Sarn Gebir, Uglúk encounters Grishnákh for the first time."
    ],
    "11_February": [
        "The beginning of Coirë and Echuir.",
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "12_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "13_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien."
    ],
    "14_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.[note 1]"
    ],
    "15_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring rests in Lothlórien.",
        "Galadriel shows Frodo and Sam the Mirror of Galadriel.",
        "After his fight with the Balrog, Gandalf returns to life.",
        "Last quarter of the Moon[1]"
    ],
    "16_February": [
        "T.A. 3019:",
        "Farewell to Lothlórien. Galadriel gives the Fellowship gifts on their departure.",
        "They travel south over the Anduin by boat while Gollum in hiding observes and follows them."
    ],
    "17_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south down the Anduin.",
        "Gwaihir bears Gandalf to Lothlórien."
    ],
    "18_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south down the Anduin. Gollum follows them on a log."
    ],
    "19_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south down the Anduin. Samwise spots Gollum on his log."
    ],
    "20_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south down the Anduin.",
        "During the night, Gollum attempts to infiltrate their camp, but is scared off by the vigilance of Aragorn and Boromir.",
        "Gandalf leaves Lothlórien and heads south carried by Gwaihir."
    ],
    "21_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south down the Anduin."
    ],
    "22_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south down the Anduin.",
        "Sam sees Gollum and talks to Frodo about him.",
        "At night, Shadowfax arrives at Edoras.",
        "New Moon[1]"
    ],
    "23_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring travels south down the Anduin.",
        "They are ambushed near Sarn Gebir at night. A frightened Gollum flees to the eastern bank and hides in the Emyn Muil. A flying shadow approaches but Legolas shoots it with the bow of Galadriel."
    ],
    "24_February": [
        "T.A. 3019:",
        "The Fellowship of the Ring carry the boats through a passage above Sarn Gebir and continue rowing after Sarn Gebir.",
        "Treebeard sees Gandalf wandering in Fangorn Forest."
    ],
    "25_February": [
        "T.A. 3019:",
        "Around noon the Fellowship of the Ring passes the Argonath and reaches Nen Hithoel; they camp at Parth Galen.",
        "First Battle of the Fords of Isen. Théodred son of Théoden is slain."
    ],
    "26_February": [
        "T.A. 3019:",
        "The breaking of the Fellowship of the Ring:",
        "Orcs from the North, Mordor and Isengard attack.",
        "Boromir blows the Great Horn, which is heard in Minas Tirith, and is slain soon after.",
        "Merry and Pippin are captured.",
        "Frodo and Samwise enter the eastern Emyn Muil, followed by Gollum.",
        "The Three Hunters set out in pursuit of the Uruk-hai at evening.",
        "In Edoras, Éomer hears of the descent of the Orcband from the Emyn Muil."
    ],
    "27_February": [
        "T.A. 3019:",
        "Orc skirmish, Grishnákh leaves. Pippin cuts his rope and drops his brooch.",
        "The Three Hunters reach the East Wall of Rohan (west-cliff of Emyn Muil) at sunrise and find the brooch.",
        "Frodo and Sam sleep at a cliff on the eastern Emyn Muil.",
        "Éomer against Théoden's orders sets out from Eastfold about midnight to pursue the Orcs."
    ],
    "28_February": [
        "T.A. 3019:",
        "Grishnákh returns.",
        "Éomer overtakes the Orcs just outside Fangorn Forest. Many Orcs under Mauhúr come. Fifteen Rohirrim, including Gárulf, fall.",
        "Frodo and Samwise try to find a way through the Emyn Muil."
    ],
    "29_February": [
        "T.A. 3019:",
        "Aragorn reaches the Downs.",
        "The Rohirrim attack at sunrise and destroy the Orcs; death of Gárulf, Grishnákh and Uglúk.",
        "Merry and Pippin escape from the Orcs and meet Treebeard.",
        "Treebeard leads the hobbits to Wellinghall and they drink the Ent-draught.",
        "Frodo and Samwise descend from the Emyn Muil and meet Gollum.",
        "Faramir sees the funeral boat of his brother Boromir."
    ],
    "1_March": [
        "T.A. 2931:",
        "Aragorn, son of Arathorn, Heir of Isildur, is born.",
        "T.A. 3019:",
        "Frodo, Sam and Gollum begin the passage of the Dead Marshes at dawn. They temporarily halt and hide from a flying Nazgûl.",
        "The Entmoot, which started on 30 February, continues.",
        "Aragorn enters Fangorn and meets Gandalf the White. They set out for Edoras.",
        "Faramir and his men leave for Ithilien to ambush the Southrons marching to Mordor.",
        "Fo.A. 120:",
        "Death of King Elessar of the Reunited Kingdom of Gondor and Arnor. Eldarion, son of Elessar and Arwen, becomes King.",
        "Fo.A. 121:",
        "Death of Arwen Undómiel, the Queen of the Reunited Kingdom, at Cerin Amroth."
    ],
    "2_March": [
        "T.A. 3019:",
        "Frodo, Sam and Gollum come to the end of the Dead Marshes.",
        "Gandalf comes to Edoras and heals Théoden. Éomer is released and Théoden holds his sword again.",
        "Wormtongue is expelled and later seen leading Orcs northward.",
        "Gandalf is named lord of Rohan and Shadowfax passes officially to him. The Rohirrim ride west against Saruman.",
        "Second Battle of the Fords of Isen, Erkenbrand is defeated.",
        "Entmoot ends in afternoon.",
        "The Ents march on Isengard and reach it at night."
    ],
    "3_March": [
        "T.A. 3019:",
        "Frodo, Sam and Gollum cross the plain between the Dead Marshes and the Black Gate.",
        "Ceorl meets Théoden's band and tells about the defeat in the Second Battle of the Fords of Isen.",
        "Gandalf goes to Isengard and Théoden retreats to Helm's Deep, where the Battle of the Hornburg ensues.",
        "Battle of Isengard; the Ents, led by Treebeard, change the course of Isen and complete the destruction of Isengard."
    ],
    "4_March": [
        "T.A. 3019:",
        "Gandalf and Erkenbrand show up and finish the Battle of the Hornburg.",
        "Théoden and Gandalf set out for Isengard with a guard of twenty Rohirrim. They pass the tombs of the Fords of Isen.",
        "The River Isen is restored to its original course.",
        "Frodo, Sam and Gollum reach the slag-mounds on the edge of the Desolation of the Morannon."
    ],
    "5_March": [
        "T.A. 3019:",
        "Wormtongue reaches Isengard at morn.",
        "Théoden and company reach Isengard at noon. They have a parley with Saruman and camp at Dol Baran.",
        "Pippin looks into the Orthanc-stone and a short time later a winged Nazgûl passes over the camp. In response, Gandalf sets out with the Hobbit for Minas Tirith.",
        "Frodo hides in sight of the Morannon, and leaves at dusk."
    ],
    "6_March": [
        "T.A. 3019:",
        "Frodo, Sam and Gollum travel towards Ithilien.",
        "Gandalf travels with Pippin along the White Mountains towards Minas Tirith.",
        "Aragorn is overtaken by the Grey Company near Dol Baran in the early hours of the day.",
        "Aragorn uses the Orthanc-stone and reveals himself to the enemy.",
        "Théoden and the éoherë leave Hornburg for Harrowdale and travel under the shadow of the White Mountains of Rohan. Aragorn leaves later, but takes a faster route across the plains of Rohan."
    ],
    "7_March": [
        "T.A. 3019:",
        "Faramir leads a raid against the Haradrim in Ithilien.",
        "He finds Frodo and Sam and takes them to Henneth Annûn. He learns about Frodo carrying the One Ring but does not try to take it.",
        "Gandalf travels with Pippin along the White Mountains towards Minas Tirith.",
        "Aragorn reaches Dunharrow at nightfall.",
        "Théoden and the éoherë travel towards Dunharrow.",
        "Full moon[1]"
    ],
    "8_March": [
        "T.A. 3019:",
        "Frodo and Sam leave Henneth Annûn and say farewell to Faramir. Gollum comes with them.",
        "Gandalf travels with Pippin along the White Mountains towards Minas Tirith.",
        "Aragorn and the Grey Company take the Paths of the Dead at daybreak. They reach the Stone of Erech at midnight.",
        "Théoden and the éoherë travel towards Dunharrow.",
        "Full Moon[1]"
    ],
    "9_March": [
        "T.A. 3019:",
        "Darkness begins to flow out of Mordor.",
        "At dusk Frodo, Sam and Gollum reach the Morgul Road.",
        "Gandalf and Pippin reach Minas Tirith. Pippin swears his sword in service to Gondor.",
        "At dusk Pippin and Bergil watch the arrival of the men of the outlands.",
        "Aragorn sets out from Erech and comes to Calembel.",
        "Théoden comes to Dunharrow.",
        "Faramir reaches Cair Andros in the evening and spends the night there."
    ],
    "10_March": [
        "T.A. 2510:",
        "Borondir and his companion depart from Minas Tirith in search of the Éothéod.",
        "T.A. 3019:",
        "The Great Signal.",
        "The Dawnless Day.",
        "Frodo, Sam and Gollum pass the Cross-roads, and see the Morgul-host set forth, towards Minas Tirith.",
        "The Muster of Rohan takes place. The Rohirrim ride from Harrowdale.",
        "Faramir is rescued by Gandalf from the Nazgûl outside the gates of the City. He meets Pippin and reports to Denethor.",
        "Aragorn, leading the Dead Men and the Grey Company, crosses the river Ringló.",
        "An army of Orcs from the Morannon takes Cair Andros and passes into Anórien."
    ],
    "11_March": [
        "T.A. 2510:",
        "Borondir and his companions are on their way in search of the Éothéod.",
        "T.A. 3019:",
        "Gollum visits Shelob, but when he sees Frodo asleep he nearly decides not to pursue his plan to recover the Ring.",
        "Denethor sends Faramir to Osgiliath.",
        "Aragorn with the Grey Company and the Dead Men reaches Linhir and crosses into Lebennin.",
        "Aragorn bids Angbor of Lamedon to follow him to Pelargir, where \"Isildur's Heir has need of him\".",
        "The Rohirrim travel towards Minas Tirith.",
        "Eastern Rohan is invaded from the north.",
        "Orcs of Dol Guldur assail Lothlórien, but they are beaten back."
    ],
    "12_March": [
        "T.A. 2510:",
        "Borondir and his companion are on their way in search of the Éothéod.",
        "T.A. 3019:",
        "Gollum leads Frodo and Sam into Shelob's Lair.",
        "Faramir has to retreat to the Causeway Forts.",
        "The Rohirrim travel towards Minas Tirith. They camp under Min-Rimmon.",
        "Aragorn drives the enemy towards Pelargir.",
        "The Ents overcome the invaders of Rohan."
    ],
    "13_March": [
        "T.A. 2510:",
        "Borondir and his companion are on their way in search of the Éothéod.",
        "T.A. 3019:",
        "Frodo is stung by Shelob and subsequently captured by the Orcs of Cirith Ungol.",
        "The Causeway Forts fall and the Rammas Echor is breached.",
        "Faramir is wounded while leading the rearguard. He is saved by a sally of the knights of Dol Amroth and Gandalf.",
        "The Pelennor is overrun by the enemies of Gondor.",
        "Faramir is brought back to Minas Tirith badly wounded.",
        "Aragorn arrives at Pelargir and captures the fleet.",
        "The Rohirrim travel towards Minas Tirith. They cross the Drúadan Forest.",
        "Beregond sees a strange light in the tower of Minas Tirith, being Denethor confronting Sauron.",
        "T.A. 3020:",
        "Frodo gets ill on the anniversary of his poisoning by Shelob.[1]",
        "T.A. 3021:",
        "Frodo is again ill.[1]"
    ],
    "14_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3019:",
        "Samwise finds Frodo in the Tower of Cirith Ungol.",
        "Minas Tirith is besieged.",
        "Aragorn sails towards Minas Tirith",
        "The Rohirrim travel towards Minas Tirith. Led by the Drúedain they reach the Grey Wood.",
        "Battle of Dale",
        "Easterlings cross the Carnen and push King Brand back to Dale.",
        "Men of Dale and Dwarves of Erebor fight a great battle at the feet of Erebor.",
        "Last Quarter of the Moon[1]"
    ],
    "15_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 2941:",
        "Gandalf meets Thorin at the Prancing Pony, and they devise a plan to rid Erebor of Smaug.",
        "T.A. 3019:",
        "In the early morning the Witch-king breaks the Gates of Minas Tirith.",
        "Denethor burns himself on a pyre. Faramir is rescued by Gandalf and Beregond and brought to the Houses of Healing.",
        "The horns of the Rohirrim echo in the sides of Mindolluin at cockcrow.",
        "Battle of the Pelennor Fields:",
        "Death of Théoden.",
        "Éowyn slays the Witch-king with the assistance of Meriadoc Brandybuck.",
        "Aragorn arrives on the battlefield and raises the standard of Elendil woven by Arwen.",
        "Frodo and Samwise escape the Tower of Cirith Ungol and begin their journey north along the Morgai.",
        "The Battle under the trees in Mirkwood takes place. Thranduil drives back the enemy from Dol Guldur.",
        "Second assault on Lothlórien."
    ],
    "16_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3019:",
        "Mustering of the Host of the West. Debate of the commanders outside Minas Tirith.",
        "Frodo and Sam travel northward along the Morgai. They look out over the camp to Mount Doom."
    ],
    "17_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3019:",
        "Battle of Dale:",
        "King Brand and King Dain Ironfoot die.",
        "Many Dwarves of Erebor and Men of Dale flee into Erebor and are besieged.",
        "Frodo and Sam travel northward along the Morgai.",
        "Shagrat brings Frodo's cloak, mail shirt and sword to Barad-dûr, where he is slain."
    ],
    "18_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3019:",
        "The Army of the West marches from Minas Tirith. After Osgiliath, they end the day march but a vanguard continues to the Cross-roads. Aragorn reclaims the land and restores the defiled statue of the King.",
        "Orcs march on the road from Durthang to Udûn.",
        "Frodo and Sam come in sight of the Isenmouthe. They are overtaken by the orc-band."
    ],
    "19_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3019:",
        "The Host of the West reaches the Morgul Vale. The Infantry joins Cavalry.",
        "Frodo and Samwise escape the Orcs and begin their journey along the road to Barad-dûr."
    ],
    "20_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3019:",
        "The Host of the West marches towards the Black Gate.",
        "Frodo and Samwise continue their journey along the road to Barad-dûr.",
        "Faramir meets Éowyn in the Houses of Healing."
    ],
    "21_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3017:",
        "Aragorn delivers Gollum as a prisoner to Thranduil of Mirkwood.",
        "T.A. 3019:",
        "The Host of the West marches towards the Black Gate.",
        "Frodo and Samwise continue their journey along the road to Barad-dûr.",
        "New Moon[1]"
    ],
    "22_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3019:",
        "The Host of the West marches towards the Black Gate.",
        "Third assault on Lothlórien.",
        "The dreadful nightfall.",
        "Frodo and Sam leave the road and turn south to Mount Doom."
    ],
    "23_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3018:",
        "Gandalf arrives in Mirkwood and begins the questioning of Gollum.",
        "T.A. 3019:",
        "The Host of the West marches towards the Black Gate. They pass out of Ithilien. Aragorn dismisses the faint-hearted.",
        "Frodo and Sam leave behind their arms and gear."
    ],
    "24_March": [
        "T.A. 2510:",
        "Borondir is on his way in search of the Éothéod.",
        "T.A. 3019:",
        "Frodo and Samwise make their last journey to the feet of Mount Doom.",
        "The Host of the West camps in the dreariness of the Morannon.",
        "T.A. 3021:",
        "The last day of the Third Age, according to the reckoning of Gondor."
    ],
    "25_March": [
        "T.A. 2510:",
        "Borondir reaches the Éothéod and delivers them the message of Cirion, Steward of Gondor.",
        "T.A. 3019:",
        "The Host of the West is surrounded by enemies on the Slag-hills.",
        "Frodo and Samwise reach the Sammath Naur. Gollum seizes the Ring and falls in the Cracks of Doom.",
        "Downfall of Barad-dûr and passing of Sauron.",
        "Frodo and Samwise are borne away by Gwaihir and his brothers.",
        "Faramir and Éowyn watch from the walls of Minas Tirith as the shadow is lifted from Mordor.",
        "An eagle brings news to Minas Tirith about the fall of Sauron.",
        "Beginning of the New Year in Gondor.",
        "T.A. 3020:",
        "Samwise returns to the Shire from forestry work; Frodo has been ill, but he has already recovered and says nothing about himself to Samwise.",
        "T.A. 3021:",
        "Beginning of the Fourth Age in the reckoning of Gondor.[1]",
        "Elanor the Fair, daughter of Samwise, is born.[1]"
    ],
    "26_March": [
        "T.A. 3019:",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien."
    ],
    "27_March": [
        "T.A. 3019:",
        "Bard II and Thorin III Stonehelm drive the Easterlings from Dale.",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien."
    ],
    "28_March": [
        "T.A. 3019:",
        "Celeborn and the Galadhrim cross the Anduin on many boats and take Dol Guldur. After the battle,  within a few days, Galadriel throws down its walls and lays bare its pits.",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien."
    ],
    "29_March": [
        "T.A. 3018:",
        "Gandalf leaves Mirkwood for the Shire.",
        "T.A. 3019:",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien."
    ],
    "30_March": [
        "T.A. 3019:",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien.",
        "First Quarter of the Moon[1]"
    ],
    "31_March": [
        "Note: Months of the Shire Calendar only have 30 days, so no events have nor will happen on the 31st."
    ],
    "1_April": [
        "T.A. 3019:",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien."
    ],
    "2_April": [
        "T.A. 3019:",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien."
    ],
    "3_April": [
        "T.A. 3019:",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien."
    ],
    "4_April": [
        "T.A. 3019:",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien."
    ],
    "5_April": [
        "T.A. 3019:",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien."
    ],
    "6_April": [
        "T.A. 2510:",
        "Eorl the Young sets out with the �oth�od towards Calenardhon.",
        "T.A. 2941:",
        "Gandalf visits Bag End but Bilbo Baggins is missing. He talks with Holman Greenhand and realises Bilbo is the right person for the Quest for Erebor (date approximate).[note 1][1]",
        "T.A. 2980:",
        "Samwise Gamgee is born.",
        "T.A. 3019:",
        "New Year of the Elves.[2]",
        "Meeting of Celeborn and Thranduil in Eryn Lasgalen. The southern portion is given to Lothl�rien, and its middle portion to the Northmen.[2]",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien.",
        "T.A. 3020:",
        "The mallorn tree planted by Samwise Gamgee in the Party Field begins to flower.[2]"
    ],
    "7_April": [
        "T.A. 2510:",
        "Eorl the Young and the �oth�od travel towards the Field of Celebrant.",
        "T.A. 3019:",
        "Frodo and Sam, rescued out of the fire, rest in Ithilien.",
        "Full Moon[1]"
    ],
    "8_April": [
        "T.A. 2510:",
        "Eorl the Young and the �oth�od travel towards the Field of Celebrant.",
        "T.A. 3019:",
        "The Ring-bearers Samwise and Frodo are honoured on the Field of Cormallen."
    ],
    "9_April": [
        "T.A. 2510:",
        "Eorl the Young and the Éothéod travel towards the Field of Celebrant."
    ],
    "10_April": [
        "T.A. 2510:",
        "Eorl the Young and the �oth�od travel towards the Field of Celebrant."
    ],
    "11_April": [
        "T.A. 2510:",
        "Eorl the Young and the Éothéod travel towards the Field of Celebrant."
    ],
    "12_April": [
        "T.A. 2510:",
        "Eorl the Young and the Éothéod travel towards the Field of Celebrant.",
        "T.A. 3018:",
        "Samwise Gamgee and Ted Sandyman are in The Green Dragon and gossip about the strange news.[1]",
        "At the evening, the weather was clearing after a rain. Samwise returns to Hobbiton, at the same time Gandalf arrives after a nine-year absence.[1]",
        "Gandalf warns Frodo that his ring is dangerous, mentions Sauron to him, but says no more until the morning.[1]"
    ],
    "13_April": [
        "T.A. 2510:",
        "Eorl the Young and the �oth�od travel towards the Field of Celebrant.",
        "T.A. 3018:",
        "In the morning Gandalf examines Bilbo's Ring and determines from its inscription that it is the One Ring. He tells Frodo of the Ring's history and Frodo volunteers to leave the Shire in order to secure the Ring.",
        "Samwise Gamgee is caught by Gandalf eavesdropping, and is (happily) obliged to accompany Frodo."
    ],
    "14_April": [
        "T.A. 2510:",
        "Eorl the Young and the �oth�od travel towards the Field of Celebrant.",
        "T.A. 3019:",
        "Last Quarter of the Moon[1]"
    ],
    "15_April": [
        "T.A. 2510:",
        "Battle of the Field of Celebrant:",
        "The Balchoth and a great host of Orcs attack the inferior host of Gondor on the Field of Celebrant.",
        "All seems lost for Gondor until the �oth�od under leadership of Eorl come to its aid.",
        "Death of Borondir Udalraph.",
        "Together with the �oth�od Gondor is victorious and Cirion, steward of Gondor, gives Calenardhon to Eorl which becomes the later Rohan."
    ],
    "16_April": [
        "There are no known events for this day."
    ],
    "17_April": [
        "There are no known events for this day."
    ],
    "18_April": [
        "There are no known events for this day."
    ],
    "19_April": [
        "There are no known events for this day."
    ],
    "20_April": [
        "There are no known events for this day."
    ],
    "21_April": [
        "T.A. 2841:",
        "Thráin sets out for the Lonely Mountain.",
        "T.A. 3019:",
        "New Moon[1]"
    ],
    "22_April": [
        "There are no known events for this day."
    ],
    "23_April": [
        "There are no known events for this day."
    ],
    "24_April": [
        "There are no known events for this day."
    ],
    "25_April": [
        "There are no known events for this day."
    ],
    "26_April": [
        "T.A. 2941:",
        "Gandalf visits Bag End looking for somebody to take part in an adventure but Bilbo rejects the offer."
    ],
    "27_April": [
        "T.A. 2941:",
        "Thirteen dwarves and Gandalf arrive at Bag End. Bilbo learns of the Lonely Mountain and Smaug and agrees to accompany the dwarves and Gandalf on their adventure."
    ],
    "28_April": [
        "T.A. 2941:",
        "Bilbo leaves Bag End and starts his journey to the Lonely Mountain with Gandalf and the dwarves."
    ],
    "29_April": [
        "T.A. 3019",
        "First Quarter[1]"
    ],
    "30_April": [
        "There are no known events for this day."
    ],
    "1_May": [
        "T.A. 2942:",
        "Bilbo and Gandalf reach Rivendell after their adventures at the Lonely Mountain.",
        "T.A. 3018:",
        "Aragorn and Gandalf meet at Sarn Ford. Gandalf tells Aragorn of Frodo's plan to leave the Shire.",
        "T.A. 3019:",
        "Crowning of King Elessar. He bids Faramir to remain Steward of Gondor.",
        "Ambassadors of the Kingdom Under the Mountain and the Kingdom of Dale are in Gondor for the coronation.",
        "Elrond and Arwen set out from Rivendell.",
        "T.A. 3020:",
        "Samwise Gamgee marries Rose Cotton."
    ],
    "2_May": [
        "T.A. 2942:",
        "Bilbo wakes up in Rivendell before dawn. The Elves are singing loud and clear under his open window."
    ],
    "3_May": [
        "There are no known events for this date."
    ],
    "4_May": [
        "There are no known events for this day."
    ],
    "5_May": [
        "There are no known events for this day."
    ],
    "6_May": [
        "T.A. 3019",
        "Full moon[1]"
    ],
    "7_May": [
        "There are no known events for this day."
    ],
    "8_May": [
        "T.A. 3019:",
        "Éomer and Éowyn depart for Rohan with Elladan and Elrohir to set their land in order."
    ],
    "9_May": [
        "There are no known events for this day."
    ],
    "10_May": [
        "There are no known events for this day."
    ],
    "11_May": [
        "There are no known events for this day."
    ],
    "12_May": [
        "There are no known events for this day."
    ],
    "13_May": [
        "T.A. 3019",
        "Last Quarter[1]"
    ],
    "14_May": [
        "There are no known events for this day."
    ],
    "15_May": [
        "There are no known events for this day."
    ],
    "16_May": [
        "There are no known events on this day."
    ],
    "17_May": [
        "There are no known events for this day."
    ],
    "18_May": [
        "There are no known events for this day."
    ],
    "19_May": [
        "There are no known events for this day."
    ],
    "20_May": [
        "T.A. 3019:",
        "Arwen and Elrond come to Lothlórien on their way to Minas Tirith."
    ],
    "21_May": [
        "The are no known events for this day."
    ],
    "22_May": [
        "There are no known events for this day."
    ],
    "23_May": [
        "There are no known events for this day."
    ],
    "24_May": [
        "There are no known events for this day."
    ],
    "25_May": [
        "There are no known events for this day."
    ],
    "26_May": [
        "There are no known events for this day."
    ],
    "27_May": [
        "T.A. 3019:",
        "Arwen and Elrond leave Lothlórien on their way to Minas Tirith."
    ],
    "28_May": [
        "There are no known events on this day."
    ],
    "29_May": [
        "T.A. 3019",
        "First quarter[1]"
    ],
    "30_May": [
        "There are no known events on this day."
    ],
    "31_May": [
        "Note: Months of the Shire Calendar only have 30 days, so no events have nor will happen on the 31st."
    ],
    "1_June": [
        "There are no known events on this day."
    ],
    "2_June": [
        "There are no known events for this day."
    ],
    "3_June": [
        "There are no known events on this day."
    ],
    "4_June": [
        "There are no known events for this day."
    ],
    "5_June": [
        "There are no known events for this day."
    ],
    "6_June": [
        "T.A. 3019",
        "Full moon[1]"
    ],
    "7_June": [
        "There are no known events for this day."
    ],
    "8_June": [
        "There are no known events for this day."
    ],
    "9_June": [
        "There are no known events for this day."
    ],
    "10_June": [
        "There are no known events for this day."
    ],
    "11_June": [
        "There are no known events for this day."
    ],
    "12_June": [
        "T.A. 3019",
        "Last quarter[1]"
    ],
    "13_June": [
        "There are no known events for this day."
    ],
    "14_June": [
        "T.A. 3019:",
        "Elrohir and Elladan meet the escort and bring Arwen to Edoras."
    ],
    "15_June": [
        "There are no known events for this day."
    ],
    "16_June": [
        "T.A. 3019:",
        "Elrohir and Elladan, with Arwen, set out for Gondor."
    ],
    "17_June": [
        "T.A. 3019:",
        "Arwen's party travels toward Minas Tirith."
    ],
    "18_June": [
        "T.A. 3019:",
        "Arwen's party travel toward Minas Tirith."
    ],
    "19_June": [
        "T.A. 3018:",
        "Faramir dreams the first time of Isildur's Bane."
    ],
    "20_June": [
        "T.A. 3018:",
        "Sauron attacks Osgiliath. Boromir and Faramir defend the bridge till its destruction.",
        "About the same time Thranduil is attacked and Gollum escapes. The War of the Ring begins.",
        "T.A. 3019:",
        "New Moon[1]"
    ],
    "21_June": [
        "There are no known events for this day."
    ],
    "22_June": [
        "T.A. 2942:",
        "Bilbo returns to Bag End[2] and learns he has been declared dead."
    ],
    "23_June": [
        "There are no known events for this day."
    ],
    "24_June": [
        "There are no known events for this day."
    ],
    "25_June": [
        "T.A. 3019:",
        "Aragorn II finds the sapling of the White Tree.[1][note 1]"
    ],
    "26_June": [
        "There are no known events for this day."
    ],
    "27_June": [
        "There are no known events for this day."
    ],
    "28_June": [
        "T.A. 3019:",
        "First quarter[1]"
    ],
    "29_June": [
        "There are no known events on this day."
    ],
    "30_June": [
        "T.A. 3018:",
        "About this time, Gandalf on his way to Bree encounters Radagast, who informs him that the Nazgûl are abroad."
    ],
    "1_July": [
        "There are no known events on this day."
    ],
    "2_July": [
        "T.A. 3019:",
        "Full moon[1]"
    ],
    "3_July": [
        "There are no known events for this day."
    ],
    "4_July": [
        "T.A. 3018:",
        "Boromir sets out from Minas Tirith to ask for counsel at Rivendell."
    ],
    "5_July": [
        "T.A. 3018:",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "6_July": [
        "T.A. 3018:",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "7_July": [
        "T.A. 3018:",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "8_July": [
        "T.A. 3018:",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "9_July": [
        "T.A. 1944:",
        "News of the oncoming of the enemy from the south-east reaches E�rnil. He and his Southern Army are already in position, and plan to meet the Wainriders at the river Poros.",
        "T.A. 3018:",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "10_July": [
        "T.A. 3018:",
        "Gandalf is imprisoned by Saruman.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "11_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "12_July": [
        "T.A. 1944:",
        "The Disaster of the Morannon.",
        "Death of Ondoher, King of Gondor, and his sons Artamir and Faramir.",
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "13_July": [
        "T.A. 1944:",
        "In the last stages of the Disaster of the Morannon, Minohtar is slain by an arrow, and his forces are routed.",
        "E�rnil arrives at the battlefield, and is victorious in the Battle of the Camp.",
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "14_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "15_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "16_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "17_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "New Moon[1]"
    ],
    "18_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "Éomer returns to Minas Tirith, after settling administrative affairs in Rohan.[1]",
        "A great feast is held in Merethrond: Gimli and Éomer come to an agreement over the lady Galadriel."
    ],
    "19_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Th�oden sets out from Minas Tirith.[1]"
    ],
    "20_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Théoden travels toward Edoras.[1]"
    ],
    "21_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Th�oden travels toward Edoras"
    ],
    "22_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Théoden travels toward Edoras"
    ],
    "23_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Th�oden travels toward Edoras"
    ],
    "24_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Théoden travels toward Edoras"
    ],
    "25_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Th�oden travels toward Edoras"
    ],
    "26_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Théoden travels toward Edoras"
    ],
    "27_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Th�oden travels toward Edoras"
    ],
    "28_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Théoden travels toward Edoras"
    ],
    "29_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Th�oden travels toward Edoras"
    ],
    "30_July": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "The funeral procession of king Théoden travels toward Edoras."
    ],
    "31_July": [
        "Note: Months of the Shire Calendar only have 30 days, so no events have nor will happen on the 31st."
    ],
    "1_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "Full moon[1]"
    ],
    "2_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "3_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "4_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "5_September": [
        "T.A. 2:",
        "After the victory over Sauron and his stay in Gondor, Isildur sets out for Arnor.",
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "6_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "Under the Mountains of Moria, Celeborn and Galadriel, Gandalf and the four Hobbits halt and tarry for several days.[1]"
    ],
    "7_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "8_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "9_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "10_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "11_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "Full moon[1]"
    ],
    "12_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "13_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "Celeborn and Galadriel depart for Lothlórien by way of the Redhorn Pass; the rest of the escort set out for Rivendell.[1]"
    ],
    "14_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "15_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "16_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "17_September": [
        "T.A. 3018:",
        "Gandalf is held captive by Saruman on the pinnacle of Orthanc.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "18_September": [
        "T.A. 3018:",
        "Gwaihir rescues Gandalf from the pinnacle of Orthanc in the early hours.",
        "The Black Riders cross the Fords of Isen.",
        "The Black Riders visit Saruman who lies that Gandalf has \"confessed\", and gives them directions to the Shire.[1]",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "19_September": [
        "T.A. 3018:",
        "Gandalf arrives at Edoras but is not allowed to enter.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "20_September": [
        "T.A. 3018:",
        "Gandalf gains entrance to Edoras and warns them about Saruman. Th�oden tells him 'Take any horse, only be gone ere tomorrow is old!'.",
        "Two covered carts leave Bag End for Frodo's new house in Crickhollow. They convey the furniture and goods that Frodo has not sold by way of the Brandywine Bridge.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "21_September": [
        "T.A. 3001:",
        "Cloudy weather over Hobbiton.[1]",
        "T.A. 3018:",
        "Gandalf meets Shadowfax, but the horse does not allow him to come near. He follows Shadowfax far over the fields.",
        "Frodo starts to become really anxious of Gandalf's absence, and keeps a constant look-out for him.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "Gandalf and the Hobbits arrive at Rivendell.[2]",
        "T.A. 3021",
        "Frodo and Sam set out from Hobbiton for the Grey Havens.[2]"
    ],
    "22_September": [
        "T.A. 2890:",
        "Bilbo Baggins is born.",
        "T.A. 2941:",
        "Bilbo and the Dwarves arrive in Lake-town.",
        "T.A. 2968:",
        "Frodo Baggins is born.",
        "T.A. 3001:",
        "Bilbo turns 111 and throws the Farewell Party at which he announces his intention to leave the Shire. He leaves behind the One Ring and sets off[1] with Nar, Anar and Hannar.[2]",
        "Frodo turns 33 and comes of age. He inherits Bag End and all the things Bilbo leaves behind.[1]",
        "T.A. 3002",
        "Frodo celebrates his birthday and honors Bilbo in his \"Hundred-weight Feast\", with twenty guests.[3]",
        "T.A. 3018:",
        "The Black Riders reach Sarn Ford at evening and drive off the guard of Rangers.",
        "Gandalf overtakes Shadowfax.",
        "Frodo celebrates his birthday with Fredegar, Merry, Pippin and Folco during which he finishes the Baggins's Old Winyards. After a lot of food and songs they drink to Bilbo's health.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "Bilbo celebrates his 129th birthday in Rivendell with Frodo and company. Saruman enters the Shire.[4]",
        "T.A. 3021:",
        "Frodo and Sam meet the Last Riding of the Keepers of the Rings in Woody End.[4]",
        "Bilbo Baggins becomes 131 years old, the longeviest Hobbit in history.",
        "Fo.A. 61:",
        "Samwise Gamgee leaves Bag End for the Tower Hills and to Grey Havens, last of the Ring-bearers.[5]",
        "Cultural significance",
        "As this day was the birthday of the Ring-bearer Frodo Baggins it became significant to the New Reckoning after the War of the Ring; corresponding to 30 Yavanni�, it was made a festival in honor of Frodo. See also: Cormare"
    ],
    "23_September": [
        "T.A. 3001:",
        "The day after the Birthday Party, Frodo manages the inheritance of Bilbo's belongings and distributes his parting gifts.",
        "The rumor spreads crowds of hobbits come to loot Bag End and seek treasure; including the Sackville-Bagginses who also demand to see Bilbo's will.",
        "At the evening Gandalf visits Frodo, warning him not to use the Ring and keep it secret. He changes his plans[1] and begins seeking Gollum.[2]",
        "T.A. 3018:",
        "Four Riders enter the Shire before dawn. The others pursue the Rangers eastward, and then return to watch the Greenway.",
        "Merry Brandybuck loads a cart with the remainder of Frodo's luggage and leaves for Crickhollow with Fatty Bolger.[3]",
        "After lunch Folco Boffin leaves Frodo with Pippin. Lobelia visits Bag End with Lotho to inspect.[3]",
        "Khamûl comes to Hobbiton at nightfall and interrogates Gaffer Gamgee, who directs him to Buckland. Frodo leaves with Sam and Pippin.[3]",
        "The three hobbits walk west of Hobbiton, traverse the Water, and after supper they join the road leading to Bucklebury. They camp in a fir-wood.[3]",
        "After taming Shadowfax, Gandalf leaves Rohan and heads for Rivendell.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "24_September": [
        "T.A. 3018:",
        "From midnight, Bag End legally passes to the ownership of the Sackville-Baggins Family.[1]",
        "Frodo, Sam and Pippin have breakfast, and after 10 they continue their walk along the road, up and down the slopes of the Green Hill Country until the top of a steep bank. They stop for lunch.[1]",
        "Gandalf crosses the Isen.",
        "Kham�l rides on the Stock Road and senses the One Ring; uncertain because of the bright daylight, he leaves and waits until the night.[2]",
        "The hobbits stop to hide from the Black Rider. They continue walking parallel to the road. They join the road around sunset.",
        "They hide in a tree-stump and have a light meal and rest, and resume by nightfall.",
        "Gildor Inglorion and his companions return from pilgrimage to the palant�r of the Tower Hills to Rivendell.",
        "Kham�l senses the ring again and pursues Frodo.[3]",
        "Frodo, Sam and Pippin encounter the Nazg�l near Woody End; he flees because of the approaching Elves' chanting. The Hobbits camp with the Elves.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "25_September": [
        "T.A. 3018:",
        "After the departure of the Elves, Khamûl resumes his search for the Ring.[1]",
        "The hobbits have breakfast with bread, fruit and drinks the High Elves left for them. Frodo decides to continue to Bucklebury by cutting through Green Hill Country and the Marish.[2]",
        "They are blocked by the Stock-brook, until they see a Black Rider for a third time, behind them; they are forced to dive into the bushes by the bank and continue their way along it.[2]",
        "They wade the stream and run into a wood; rain falls over the Marish. At mid-day they have a lunch beside a sheltered elm.[2]",
        "Unable to find Frodo, Khamûl summons another Nazgûl from Dol Guldur.[1] The two evil cries disturb the hobbits who are resting.[2]",
        "The two Ringwraiths go eastwards. Khamûl[1] interrogates Farmer Maggot about \"Baggins\", but he doesn't cooperate.[2] Khamûl sends his companion towards the Overbourn Marshes while himself goes towards the Brandywine Bridge.[1]",
        "Leaving the wood, the hobbits see that they have turned too much to the south; adjusting their course to the Bucklebury Ferry, they reach a turnip field outside Maggot's estates in the afternoon.[2]",
        "After a dinner, Maggot takes the hobbits with his waggon to the Ferry. They meet Merry looking for them.[2] Khamûl also arrives at the Bucklebury Ferry but too late.[1]",
        "They reach Crickhollow in the night. Frodo reveals them his plans but they are already known. In the night he dreams about the trees of the Old Forest.[3]",
        "Gandalf hurries towards The Shire on Shadowfax.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "26_September": [
        "T.A. 3018:",
        "The Hobbits leave Fredegar Bolger back in Crickhollow to impersonate Frodo. They enter the Old Forest.",
        "They encounter Old Man Willow and are rescued by Tom Bombadil who hosts them to his house. Frodo dreams about Gandalf.",
        "Two Nazg�l come to Bree from the South road.",
        "Gandalf hurries towards The Shire on Shadowfax.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "27_September": [
        "T.A. 3018:",
        "Frodo and his companions spend the second night with Tom Bombadil because of the rain. While discussing with him about the One Ring, Frodo wears it for first time.",
        "Gandalf crosses Greyflood.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "New moon[1]"
    ],
    "28_September": [
        "T.A. 3018:",
        "Frodo and his companions traverse the Barrow-downs and  are captured by a Barrow-wight. Tom Bombadil rescues them, finds and renames their five ponies, gives them weapons and suggests to visit the Prancing Pony at Bree.",
        "Gandalf reaches Sarn Ford.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "At night Kham�l and the Ringwraith from Dol Guldur arrive at Crickhollow; Kham�l sends the Dol Guldur Ringwraith to collect the Ringwraith who guarded the Brandywine Bridge and the horses that they had left behind. The three Ringwraiths then watch Crickhollow through the night until the next morning.[1]"
    ],
    "29_September": [
        "T.A. 3018:",
        "Gandalf visits the Gaffer.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "Harry Goatleaf lets Black Riders into Bree.[1]",
        "Strider hides behind the hedge on the Road west of Bree and eavesdrops on \"Mr. Underhill\". Frodo and his companions reach Bree at night and Harry lets them in. Strider follows climbing over the gate.[1]",
        "The hobbits stay at the Prancing Pony. Barliman Butterbur takes them to the parlor for dinner.[1]",
        "Butterbur doesn't let Strider interrupt Frodo, and stays in the Commons room; Bill Ferny is also there. After dinner, the hobbits, join, while Merry stays in the parlor.[1]",
        "Pippin interacts with the people in the room while Strider finally talks to Frodo. Merry is going for a walk.[1]",
        "In the inn Frodo arouses attention by his sudden disappearance by wearing the One Ring. Seeing this, Bill leaves for his home. Meanwhile Merry sees a Black Rider outside.[1]",
        "Strider warns Frodo to be more careful and in the parlor he reveals himself as being Gandalf's friend. Meanwhile Merry follows the Rider to Bill's house, where Bill tells about Frodo's disappearance.[1]",
        "Barliman Butterbur finally gives Frodo Gandalf's letter and sends Nob to find Merry. Harry recognises Merry and two Riders go to take him, while one goes to notify the Witch-king; merry faints because of the Black Breath.",
        "Nob finds Merry and shouts at people attempting to carry him away.[1]",
        "Merry returns to the parlor. Anticipating an attack, the hobbits's rooms are abandoned while Strider and Nob create disguises.[1]",
        "T.A. 3021:",
        "Gandalf, Frodo Baggins, Bilbo Baggins, Galadriel and Elrond leave Middle-earth on the White Ship and pass over the Sea."
    ],
    "30_September": [
        "T.A. 3018:",
        "Crickhollow is raided by three Black Riders in the early hours and Fatty Bolger alerts the village. The Black Riders run away.",
        "The Inn at Bree is simultaneously raided but the Black Riders find only pillows in the Hobbits' beds. The ponies are lost.",
        "Frodo and his companions buy Bill the Pony from Bill Ferny and leave Bree together with Strider.",
        "Gandalf comes to Crickhollow and sees Frodo's cloak outside. Losing hope, he reaches Bree at night. He meets Barliman Butterbur who apologises and tells him the Hobbits left with Strider.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "1_October": [
        "T.A. 3018:",
        "Together with Strider the four hobbits travel towards Weathertop.",
        "Gandalf leaves Bree.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "Full moon[1]"
    ],
    "2_October": [
        "T.A. 3018:",
        "Together with Strider the four hobbits travel towards Weathertop. They enter the Midgewater Marshes.",
        "Gandalf travels towards Weathertop as well.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "3_October": [
        "T.A. 3018:",
        "Gandalf arrives at Weathertop and marks a stone. At night he is attacked there by the Black Riders. He manages to escape with four Riders behind him.",
        "Together with Strider the four hobbits travel towards Weathertop. They see flashes from the fight at Weathertop while they leave the Midgewater Marshes.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "First Quarter[1]"
    ],
    "4_October": [
        "T.A. 3018:",
        "Together with Strider the four hobbits travel towards Weathertop.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "5_October": [
        "T.A. 2:",
        "The Disaster of the Gladden Fields",
        "Death of Isildur and his sons Elendur, Aratan and Ciryon.",
        "T.A. 3018:",
        "Together with Strider the four hobbits travel towards Weathertop.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "Gandalf and the four Hobbits leave Rivendell for Bree and the Shire.[1]"
    ],
    "6_October": [
        "T.A. 3018:",
        "The travellers climb Weathertop at noon. They find Gandalf's stone.",
        "The camp under Weathertop is raided at night, and Frodo is attacked by the Witch-king who attempts to hit his heart with a Morgul blade that will make him a wraith. Frodo wears the Ring and is wounded on the shoulder.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "T.A. 3019:",
        "At the crossing of the Ford of Bruinen, Frodo feels the first return of pain from his stab wound.[1]",
        "T.A. 3020:",
        "Frodo feels the pain return again.[1]",
        "T.A. 3021:",
        "Sam returns to Bag End on his faithful pony, Bill, after seeing off many of his friends at the Grey Havens.[1]"
    ],
    "7_October": [
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "8_October": [
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "9_October": [
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Glorfindel and other High Elves leave Rivendell in search of the Ring-bearer.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "10_October": [
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Glorfindel travels towards the Last Bridge.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "11_October": [
        "Fifth Day After Weathertop by Ted Nasmith",
        "F.A. 495:",
        "At Vinyamar, Ulmo speaks to Tuor and instructs him to go to Gondolin to deliver a message to Turgon.",
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Glorfindel drives three Riders off the Last Bridge of Mitheithel and pursues them westward. He meets two others who flee southward. He leaves a beryl on the Bridge. He starts looking for the travellers.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "Full moon[1]"
    ],
    "12_October": [
        "F.A. 495:",
        "Tuor meets Voronw� who agrees to show Tuor the way to Gondolin. The pair set out on their journey.",
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "13_October": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell. They cross the Last Bridge and find the beryl left by Glorfindel.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "14_October": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "15_October": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "16_October": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Glorfindel finds their trail and follows them over the Last Bridge.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "17_October": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell.",
        "Gandalf hurries towards Rivendell after the Black Riders attacked him on Weathertop.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "18_October": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "With Frodo severely wounded, Strider and the four hobbits travel slowly towards Rivendell. They find Bilbo's Trolls and soon after the East Road. There they are found by Glorfindel at dusk.",
        "Gandalf reaches Rivendell from the North and sends Shadowfax back to Rohan.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "19_October": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 2941:",
        "Durin's Day.[1]",
        "T.A. 3018:",
        "Glorfindel hurries Strider and the four hobbits along and they cover a great distance towards the Ford of Bruinen.",
        "Boromir travels towards Rivendell to ask for counsel.",
        "Last quarter[2]"
    ],
    "20_October": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Glorfindel, Strider and the four hobbits reach the Ford of Bruinen where they are attacked by Black Riders. Frodo reaches the other riverside but the Riders are cast back by the water, their horses drown and their robes are destroyed.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "21_October": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo recovers from his wound in Rivendell.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "22_October": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo recovers from his wound in Rivendell.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "23_October": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo recovers from his wound in Rivendell. Elrond finds the blade shard in his shoulder and removes it.",
        "Boromir travels towards Rivendell to ask for counsel."
    ],
    "24_October": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo Baggins awakes in Rivendell, recovered from his wound, and meets Gandalf.",
        "Elrond makes a feast where Frodo meets Gl�in. Elladan and Elrohir return and talk to Aragorn. Evening at the Hall of Fire where Frodo meets Bilbo Baggins.",
        "Boromir reaches Rivendell at night."
    ],
    "25_October": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "The Council of Elrond. It is decided that the One Ring must go to Mordor. Frodo and Sam take the mission.",
        "Aragorn, Elladan and Elrohir go out to scout the vicinity."
    ],
    "26_October": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "New moon[1]"
    ],
    "27_October": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "28_October": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "T.A. 3019:",
        "Nightfall: Gandalf and the four Hobbits reach Bree[1] and find out much has changed since they last were there."
    ],
    "29_October": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "30_October": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "T.A. 3019:",
        "Gandalf and the four Hobbits leave Bree.[1] Gandalf leaves to visit Tom Bombadil.",
        "Night: The Travellers come to the Brandywine Bridge.[1]",
        "Full moon[2]"
    ],
    "31_October": [
        "Note: Months of the Shire Calendar only have 30 days, so no events have nor will happen on the 31st."
    ],
    "1_November": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "T.A. 3019:",
        "At their arrival in the Shire, the four Hobbits are arrested at Frogmorton[1] by the First Eastfarthing Troop and taken to the Shirriff-house."
    ],
    "2_November": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "T.A. 3019:",
        "The Travellers come to Bywater and rouse the Shire-folk.",
        "The above event was commemorated in Buckland by sounding the Horn of the Mark and other festivities."
    ],
    "3_November": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "First quarter[1]",
        "T.A. 3019:",
        "Battle of Bywater[2]",
        "Passing of Saruman and death of Gr�ma Wormtongue",
        "End of the War of the Ring"
    ],
    "4_November": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "T.A. 3019:",
        "Following the Battle of Bywater, restoration of the Shire begins. Frodo frees the prisoners of the Lockholes, including Lobelia Sackville-Baggins, Fredegar Bolger and Will Whitfoot."
    ],
    "5_November": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "6_November": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "7_November": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "8_November": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon. They reach the Pools of Ivrin and see Túrin.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "9_November": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "10_November": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 2994:",
        "Balin, Lord of Moria, is killed by an Orc archer as he stood to watch in Mirrormere.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "11_November": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 2994:",
        "A Dwarf (perhaps Ori) writes in the Book of Mazarbul about Balin's death the previous day.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "Full moon[1]"
    ],
    "12_November": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "13_November": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "14_November": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "15_November": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "16_November": [
        "F.A. 495:",
        "Tuor, guided by Voronwë, travels to Gondolin in order to deliver Ulmo's message to Turgon.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "17_November": [
        "F.A. 495:",
        "Tuor, guided by Voronw�, travels to Gondolin in order to deliver Ulmo's message to Turgon. Approaching the Echoriad they avoid a band of orcs on the Old South Road.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "18_November": [
        "F.A. 495:",
        "Tuor and Voronwë travel up the Dry River and approach Gondolin.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "19_November": [
        "F.A. 495:",
        "Tuor and Voronw� pass the Seven Gates to reach Gondolin. They are taken to Turgon who is told that they should abandon the city; Turgon decides to stay.",
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "Last quarter[1]"
    ],
    "20_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "21_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "22_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "23_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "24_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "25_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "26_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "New moon[1]"
    ],
    "27_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "28_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "29_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "30_November": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "1_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "2_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "First quarter[1]"
    ],
    "3_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "4_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "5_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "6_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "7_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "9_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "10_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring.",
        "Full moon[1]"
    ],
    "11_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "12_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "13_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "14_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "15_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "16_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "17_December": [
        "T.A. 3018:",
        "Frodo and Samwise rest in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "18_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring is formed.",
        "Last quarter[1]"
    ],
    "19_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring rests in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "20_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring rests in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "21_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring rests in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "22_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring rests in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "23_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring rests in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "24_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring rests in Rivendell and prepare for their quest to destroy the One Ring."
    ],
    "25_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring leaves Rivendell at dusk.",
        "New moon[1]:xlviii"
    ],
    "26_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "27_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "28_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "29_December": [
        "This date marks the beginning of the six-day Yuletide festival in the Shire Calendar.",
        "T.A. 3018:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "30_December": [
        "T.A. 3018:",
        "The Fellowship of the Ring travels south along the Misty Mountains."
    ],
    "31_December": [
        "Note: Months of the Shire Calendar only have 30 days, so no events have nor will happen on the 31st."
    ]
}
